def lcs(X, Y, m, n):
    if m == 0 or n == 0:
        # если одна из строк равна 0 то вернем 0
        return 0
    elif X[m-1] == Y[n-1]:
        # если последние символы строк равны,
        # то увеличиваем длину строки на 1
        # и вызываем функцию lcs для оставшейся строки
        return 1 + lcs(X, Y, m-1, n-1)
    else:
        # если последние символы строк не равны, 
        # то находим максиум между значений,
        # которые вернёт функция
        # для обоих вариантов удаления последнего символа из одной из строк 
        return max(lcs(X, Y, m, n-1), lcs(X, Y, m-1, n))
X = "bd0"
Y = "abcd0"
print("LCS длина: ", lcs(X, Y, len(X), len(Y)))